/****************************************************************************************************
【平    台】龙邱K66FX智能车VC母板
【编    写】LQ-005
【E-mail  】chiusir@163.com
【软件版本】V1.0
【最后更新】2019年04月12日
【相关信息参考下列地址】
【网    站】http://www.lqist.cn
【淘宝店铺】http://shop36265907.taobao.com
------------------------------------------------
【dev.env.】IAR8.2
【Target  】K66FX1M0VLQ18
【Crystal 】 50.000Mhz
【busclock】 40.000MHz
【pllclock】200.000MHz
-------------------------------------------------------------
LED             单片机接口
LED0            PTE26
LED1            PTA17
LED2            PTC0
LED3            PTD15
=============================================================
-------------------------------------------------------------
按键            单片机接口
K0              PTB20
K1              PTB21
K2              PTB22
-------------------------------------------------------------
-------------------------------------------------------------
OLED/TFT1.8模块 单片机接口
VCC             3.3V
GND             GND
SCK             PTC16
SDA             PTC15
RST             PTC14
DC              PTC13
CS              PTC12 
-------------------------------------------------------------
******************************************************************************************************/

#include "include.h" 
//user define

//主函数
void main(void)
{   
    PLL_Init(PLL180);         //初始化PLL为180M 
	
	/* 设置中断优先级组  0: 0个抢占优先级16位个子优先级 
	* 1: 2个抢占优先级 8个子优先级 2: 4个抢占优先级 4个子优先级 
	* 3: 8个抢占优先级 2个子优先级 4: 16个抢占优先级 0个子优先级
	*/
	/* 配置优先级组 2: 4个抢占优先级 4个子优先级 */
    NVIC_SetPriorityGrouping(0x07 - 2); 

    LED_Init();
    KEY_Init();
    UART_Init(UART4, 115200);
    OLED_Init();
    
    ADC_Init(ADC0);
    ADC_Init(ADC1);
    
    FTM_PwmInit(FTM0, FTM_CH0, 12000, 0);
    FTM_PwmInit(FTM0, FTM_CH1, 12000, 0);
    FTM_PwmInit(FTM0, FTM_CH2, 12000, 0);
    FTM_PwmInit(FTM0, FTM_CH3, 12000, 0);
    
    FTM_ABInit(FTM1);
    FTM_ABInit(FTM2);
    
    SpeeedPID_Init();  

    OLED_P8x16Str(5,0,(uint8_t*)"Go for it!"); 
    delayms(3000);    
    OLED_CLS();
    
    PIT_Init_PID();
//------------------------------------------------------------------------------------------------    
//测试ADC端口  检测电压打印并显示 在include.h 宏定义选择OLED或TFT1.8  
//注意电压不要大于3.3V  悬空不等于接地
//------------------------------------------------------------------------------------------------    
    
    //DisableInterrupts;
   // EnableInterrupts; 
    
    ParamOut();

}
